#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.sonarqube.data.azurerm_client_config.current: Reading...
module.sonarqube.data.azurerm_subscription.current: Reading...
module.sonarqube.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9MTIzZGU3MWUtYTRmYy00NWNlLTg1NTQtNGRlODFiNjQwNDA3O3N1YnNjcmlwdGlvbklkPWVkNTg3ZTE1LTJiOTItNDBiMC1hYmQxLWZlYjA5NzcxNTA5ZDt0ZW5hbnRJZD04ZGNjMWM4NS01MGM4LTQxYmItYmE3My1iZTBiZjM2ZjgyN2Y=]
module.sonarqube.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/ed587e15-2b92-40b0-abd1-feb09771509d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.nsg_aci will be created
  + resource "azurerm_network_security_group" "nsg_aci" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "sonarqubensgaci"
      + resource_group_name = "sonarqubetest"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "9000"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowSonarQube"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "sonarqube"
        }
    }

  # azurerm_network_security_group.nsg_appgw will be created
  + resource "azurerm_network_security_group" "nsg_appgw" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "sonarqubensgappgw"
      + resource_group_name = "sonarqubetest"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_ranges                    = [
                  + "80",
                ]
              + direction                                  = "Inbound"
              + name                                       = "AllowWebInbound"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (2 unchanged attributes hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "65200-65535"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAppGwInbound"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "sonarqube"
        }
    }

  # azurerm_network_security_group.nsg_db will be created
  + resource "azurerm_network_security_group" "nsg_db" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "sonarqubensgdb"
      + resource_group_name = "sonarqubetest"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "5432"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowPostgreSQL"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "sonarqube"
        }
    }

  # azurerm_network_security_group.nsg_web will be created
  + resource "azurerm_network_security_group" "nsg_web" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "sonarqubensgweb"
      + resource_group_name = "sonarqubetest"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_ranges                    = [
                  + "443",
                  + "80",
                ]
              + direction                                  = "Inbound"
              + name                                       = "AllowWebInbound"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (2 unchanged attributes hidden)
            },
        ]
      + tags                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "sonarqube"
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "sonarqubetest"
    }

  # azurerm_subnet.subnet_aci will be created
  + resource "azurerm_subnet" "subnet_aci" {
      + address_prefixes                              = [
          + "172.17.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "sonarqubesubnetaci"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "sonarqubetest"
      + service_endpoints                             = [
          + "Microsoft.ContainerRegistry",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "sonarqubevnet"

      + delegation {
          + name = "Microsoft.ContainerInstance/containerGroups"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.ContainerInstance/containerGroups"
            }
        }
    }

  # azurerm_subnet.subnet_appgw will be created
  + resource "azurerm_subnet" "subnet_appgw" {
      + address_prefixes                              = [
          + "172.17.3.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "sonarqubesubnetappgw"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "sonarqubetest"
      + virtual_network_name                          = "sonarqubevnet"
    }

  # azurerm_subnet.subnet_pgsql will be created
  + resource "azurerm_subnet" "subnet_pgsql" {
      + address_prefixes                              = [
          + "172.17.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "sonarqubesubnetpgsql"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "sonarqubetest"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "sonarqubevnet"

      + delegation {
          + name = "Microsoft.DBforPostgreSQL/flexibleServers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # azurerm_subnet.subnet_privateendpoints will be created
  + resource "azurerm_subnet" "subnet_privateendpoints" {
      + address_prefixes                              = [
          + "172.17.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "sonarqubesubnetprivateendpoints"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "sonarqubetest"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "sonarqubevnet"
    }

  # azurerm_subnet_network_security_group_association.nsg_aci will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_aci" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_appgw will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_appgw" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_pgsql will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_pgsql" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.nsg_privateendpoints will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_privateendpoints" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "172.17.0.0/21",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "northeurope"
      + name                           = "sonarqubevnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "sonarqubetest"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "sonarqube"
        }
    }

  # module.sonarqube.azurerm_application_gateway.sonarqube will be created
  + resource "azurerm_application_gateway" "sonarqube" {
      + enable_http2                = true
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "sonarqubetestappgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "sonarqubetest"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = (known after apply)
          + name         = "backendAppPool"
        }

      + backend_http_settings {
          + cookie_based_affinity                = "Disabled"
          + dedicated_backend_connection_enabled = false
          + id                                   = (known after apply)
          + name                                 = "backendHttpSettings"
          + pick_host_name_from_backend_address  = false
          + port                                 = 9000
          + probe_id                             = (known after apply)
          + protocol                             = "Http"
          + request_timeout                      = 20
          + trusted_root_certificate_names       = []
            # (4 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "frontendIpConfiguration"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "frontendHttpPort"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gatewayIpConfiguration"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "frontendIpConfiguration"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "frontendHttpPort"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "httpListener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (4 unchanged attributes hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "backendAppPool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "backendHttpSettings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "httpListener"
          + id                          = (known after apply)
          + name                        = "routingRuleHttp80"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + sku {
          + capacity = 1
          + name     = "Basic"
          + tier     = "Basic"
        }

      + ssl_policy (known after apply)
    }

  # module.sonarqube.azurerm_container_group.sonarqube will be created
  + resource "azurerm_container_group" "sonarqube" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = [
          + {
              + port     = 9000
              + protocol = "TCP"
            },
        ]
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "northeurope"
      + name                        = (known after apply)
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "sonarqubetest"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = (known after apply)

      + container {
          + commands                     = (known after apply)
          + cpu                          = 2
          + cpu_limit                    = 0
          + environment_variables        = {
              + "SONAR_ES_BOOTSTRAP_CHECKS_DISABLE" = "true"
              + "SONAR_SEARCH_JAVAADDITIONALOPTS"   = "-Dnode.store.allow_mmap=false,-Ddiscovery.type=single-node"
              + "SONAR_WEB_CONTEXT"                 = "/"
            }
          + image                        = (known after apply)
          + memory                       = 6
          + memory_limit                 = 0
          + name                         = "sonarqube"
          + secure_environment_variables = (sensitive value)

          + ports {
              + port     = 9000
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/data"
              + name                 = "sonar-data"
              + read_only            = false
              + share_name           = "sonarqubetestdatashare"
              + storage_account_key  = (sensitive value)
              + storage_account_name = (known after apply)
            }
          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/extensions"
              + name                 = "sonar-extensions"
              + read_only            = false
              + share_name           = "sonarqubetestextensionsshare"
              + storage_account_key  = (sensitive value)
              + storage_account_name = (known after apply)
            }
          + volume {
              + empty_dir            = false
              + mount_path           = "/opt/sonarqube/logs"
              + name                 = "sonar-logs"
              + read_only            = false
              + share_name           = "sonarqubetestlogsshare"
              + storage_account_key  = (sensitive value)
              + storage_account_name = (known after apply)
            }
        }

      + diagnostics {
          + log_analytics {
              + workspace_id  = (known after apply)
              + workspace_key = (sensitive value)
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + image_registry_credential {
          + server                    = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }
    }

  # module.sonarqube.azurerm_container_registry.sonarqube will be created
  + resource "azurerm_container_registry" "sonarqube" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = (known after apply)
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "sonarqubetest"
      + sku                           = "Basic"
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.sonarqube.azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "sonarqubetestkeyvault"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = (known after apply)
      + resource_group_name           = "sonarqubetest"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "8dcc1c85-50c8-41bb-ba73-be0bf36f827f"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.sonarqube.azurerm_key_vault_access_policy.kv_policy_appgw will be created
  + resource "azurerm_key_vault_access_policy" "kv_policy_appgw" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id          = "8dcc1c85-50c8-41bb-ba73-be0bf36f827f"
    }

  # module.sonarqube.azurerm_key_vault_secret.sonarqube_db_password will be created
  + resource "azurerm_key_vault_secret" "sonarqube_db_password" {
      + content_type            = "text/plain"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sonar-db-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sonarqube.azurerm_log_analytics_workspace.sonarqube will be created
  + resource "azurerm_log_analytics_workspace" "sonarqube" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = 5
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "northeurope"
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "sonarqubetest"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.sonarqube.azurerm_management_lock.sonarqube_acr will be created
  + resource "azurerm_management_lock" "sonarqube_acr" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "sonarqubetest"
      + scope      = (known after apply)
    }

  # module.sonarqube.azurerm_management_lock.sonarqube_appgw will be created
  + resource "azurerm_management_lock" "sonarqube_appgw" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "sonarqubetest"
      + scope      = (known after apply)
    }

  # module.sonarqube.azurerm_management_lock.sonarqube_pgsql will be created
  + resource "azurerm_management_lock" "sonarqube_pgsql" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "sonarqubetest"
      + scope      = (known after apply)
    }

  # module.sonarqube.azurerm_postgresql_flexible_server.sonarqube will be created
  + resource "azurerm_postgresql_flexible_server" "sonarqube" {
      + administrator_login           = "sonar"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = (known after apply)
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "sonardbserver"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "sonarqubetest"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "16"
      + zone                          = "1"

      + authentication {
          + active_directory_auth_enabled = false
          + password_auth_enabled         = true
        }
    }

  # module.sonarqube.azurerm_postgresql_flexible_server_database.sonarqube will be created
  + resource "azurerm_postgresql_flexible_server_database" "sonarqube" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "sonar"
      + server_id = (known after apply)
    }

  # module.sonarqube.azurerm_private_dns_zone.keyvault_dns will be created
  + resource "azurerm_private_dns_zone" "keyvault_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "sonarqubetest"

      + soa_record (known after apply)
    }

  # module.sonarqube.azurerm_private_dns_zone.pgsql_server_dns will be created
  + resource "azurerm_private_dns_zone" "pgsql_server_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "sonarqubetest"

      + soa_record (known after apply)
    }

  # module.sonarqube.azurerm_private_dns_zone.sa_file_dns will be created
  + resource "azurerm_private_dns_zone" "sa_file_dns" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "sonarqubetest"

      + soa_record (known after apply)
    }

  # module.sonarqube.azurerm_private_dns_zone_virtual_network_link.keyvault_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault_vnetlink" {
      + id                    = (known after apply)
      + name                  = "sonarqubetestkeyvaultvnetlink"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "sonarqubetest"
      + virtual_network_id    = (known after apply)
    }

  # module.sonarqube.azurerm_private_dns_zone_virtual_network_link.pgsql_server_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "pgsql_server_vnetlink" {
      + id                    = (known after apply)
      + name                  = "sonarqubetestpgsqlvnetlink"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "sonarqubetest"
      + virtual_network_id    = (known after apply)
    }

  # module.sonarqube.azurerm_private_dns_zone_virtual_network_link.sa_file_vnetlink will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "sa_file_vnetlink" {
      + id                    = (known after apply)
      + name                  = "sonarqubetestsafilevnetlink"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "sonarqubetest"
      + virtual_network_id    = (known after apply)
    }

  # module.sonarqube.azurerm_private_endpoint.keyvault_pe will be created
  + resource "azurerm_private_endpoint" "keyvault_pe" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "sonarqubetestkeyvault-pe-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "sonarqubetestkeyvault-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "sonarqubetest"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "sonarqubetestkeyvault-private-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.sonarqube.azurerm_private_endpoint.sa_file_pe will be created
  + resource "azurerm_private_endpoint" "sa_file_pe" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "sonarqubetestsafile-pe-nic"
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "sonarqubetestsafile-pe"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "sonarqubetest"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "sonarqubetestsafile-private-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.sonarqube.azurerm_public_ip.appgw will be created
  + resource "azurerm_public_ip" "appgw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = (known after apply)
      + resource_group_name     = "sonarqubetest"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.sonarqube.azurerm_role_assignment.appgw2kv will be created
  + resource "azurerm_role_assignment" "appgw2kv" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sonarqube.azurerm_role_assignment.sonarqube2acr will be created
  + resource "azurerm_role_assignment" "sonarqube2acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sonarqube.azurerm_storage_account.sonarqube will be created
  + resource "azurerm_storage_account" "sonarqube" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "northeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "sonarqubetest"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.sonarqube.azurerm_storage_share.sonarqube_data will be created
  + resource "azurerm_storage_share" "sonarqube_data" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "sonarqubetestdatashare"
      + quota               = 5
      + resource_manager_id = (known after apply)
      + storage_account_id  = (known after apply)
      + url                 = (known after apply)
    }

  # module.sonarqube.azurerm_storage_share.sonarqube_extensions will be created
  + resource "azurerm_storage_share" "sonarqube_extensions" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "sonarqubetestextensionsshare"
      + quota               = 1
      + resource_manager_id = (known after apply)
      + storage_account_id  = (known after apply)
      + url                 = (known after apply)
    }

  # module.sonarqube.azurerm_storage_share.sonarqube_logs will be created
  + resource "azurerm_storage_share" "sonarqube_logs" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "sonarqubetestlogsshare"
      + quota               = 5
      + resource_manager_id = (known after apply)
      + storage_account_id  = (known after apply)
      + url                 = (known after apply)
    }

  # module.sonarqube.azurerm_user_assigned_identity.appgw will be created
  + resource "azurerm_user_assigned_identity" "appgw" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "sonarqubetestappgw"
      + principal_id        = (known after apply)
      + resource_group_name = "sonarqubetest"
      + tenant_id           = (known after apply)
    }

  # module.sonarqube.azurerm_user_assigned_identity.sonarqube will be created
  + resource "azurerm_user_assigned_identity" "sonarqube" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "sonarqubetestacrsonarqube"
      + principal_id        = (known after apply)
      + resource_group_name = "sonarqubetest"
      + tenant_id           = (known after apply)
    }

  # module.sonarqube.null_resource.sonar_image_pull_tag_push will be created
  + resource "null_resource" "sonar_image_pull_tag_push" {
      + id = (known after apply)
    }

  # module.sonarqube.random_password.sonarqube_db_password will be created
  + resource "random_password" "sonarqube_db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.sonarqube.random_string.resource_name_suffix will be created
  + resource "random_string" "resource_name_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aci_name   = (known after apply)
  + appgw_fqdn = (known after apply)

```

</details>

*Pusher: @mablanco, Action: `pull_request`, Working Directory: `/home/runner/work/terraform-azure-sonarqube/terraform-azure-sonarqube/examples/default`, Workflow: `Terraform Checks`*